In [1]:
people = {
    'first': ['Corey', 'Jane', 'John'],
    'last': ['Schafer', 'Doe', 'Doe'],
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ['first name', 'last name', 'email']

In [7]:
df

  first name last name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [8]:
df.columns = [x.lower() for x in df.columns]
df

  first name last name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [9]:
df.columns = df.columns.str.replace(' ', '_')
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [10]:
df.rename(columns = {'first_name':'first', 'last_name':'last'}, inplace=True)

In [11]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [13]:
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']

In [14]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [16]:
df.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@email.com']

In [17]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [18]:
df.loc[2, 'last'] = 'Smith'

In [19]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [20]:
df.at[2, 'last'] = 'Doe'

In [21]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [27]:
filt = (df['email'] == 'JohnDoe@email.com')
df[filt]['last'] = 'Smith'

c:\users\tanishq sharma\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [30]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt, 'last'] = 'Smith'

In [31]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [34]:
#Changing multiple columns
df['email'] = df['email'].str.lower()

In [35]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [36]:
#4 methods to change
#1 apply
#2 map
#3 applymap
#4 replace

In [37]:
#1 apply

In [38]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [39]:
def update_email(email):
    return email.upper()

In [42]:
df['email'] = df['email'].apply(update_email)

In [43]:
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John    Smith        JOHNDOE@EMAIL.COM

In [44]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [45]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [46]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [47]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [48]:
df.apply(len, axis = 'columns')

0    3
1    3
2    3
dtype: int64

In [49]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [50]:
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [53]:
#2 Apply Map : Only works on dataframe, apply to each individual value in dataframe

In [52]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     17

In [54]:
df.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john    smith        johndoe@email.com

In [55]:
#3 map : Works only on series, value we didn't substitute converts to NaN

In [56]:
df['first'].map({'Corey':'Chris', 'Jane':'Merry'})

0    Chris
1    Merry
2      NaN
Name: first, dtype: object

In [59]:
#4 Replace :

In [63]:
df['first'] = df['first'].replace({'Corey':'Chris', 'Jane':'Merry'})

In [64]:
df

   first     last                    email
0  Chris  Schafer  coreymschafer@gmail.com
1  Merry      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com